In [2]:
import pandas as pd

In [3]:
col_names = ['user_id','age','gender','occupation','zip_code']
users = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.user',
                    sep = '|',
                    names = col_names)

In [10]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [9]:
col_names = ['user_id','movie_id','rating','unix_timestamp']
ratings = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.data',
                    sep = '\t',
                    names = col_names)

In [13]:
ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [14]:
col_names = ['movie_id','title','release_date','video_release_date','imdb_url']
movies = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.item',
                    sep = '|',
                    names = col_names,
                    usecols = range(5))

In [15]:
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

In [17]:
print (users.dtypes)

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [21]:
selected_columns = ['occupation','gender']
users[selected_columns].head()

   occupation gender
0  technician      M
1       other      F
2      writer      M
3  technician      M
4       other      F

In [25]:
users.iloc[-1]

user_id           943
age                22
gender              M
occupation    student
zip_code        77841
Name: 942, dtype: object

In [26]:
old_users = users[users.age > 35]
old_users.head()

   user_id  age gender     occupation zip_code
1        2   53      F          other    94043
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
9       10   53      M         lawyer    90703

In [32]:
males_40_years_old = users[(users.gender == 'M') & (users.age == 40)]
males_40_years_old.head()

     user_id  age gender  occupation zip_code
18        19   40      M   librarian    02138
82        83   40      M       other    44133
115      116   40      M  healthcare    97232
199      200   40      M  programmer    93402
283      284   40      M   executive    92629

In [37]:
selected_users = users[(users.gender == 'F') & (users.age >= 18) & (users.age <= 25)]
selected_users['age'].mean()

21.158730158730158

In [50]:
# get the diligent users
groups = ratings['movie_id'].groupby(ratings.user_id)
ratings_per_user = groups.count()
ratings_per_user.head(3)

user_id
1    272
2     62
3     54
Name: movie_id, dtype: int64

In [98]:
# get the average rating per movie
movie_rating_groups = ratings['rating'].groupby(ratings.movie_id)
mean_rating_per_movie = movie_rating_groups.mean()
top30 = mean_rating_per_movie.sort_values(ascending = False).head(30)
# get the highest average rating movies titles
print(top30.index)
good_movies = top30.index
movies[movies.movie_id.isin(good_movies)].title

Int64Index([1293, 1467, 1653,  814, 1122, 1599, 1201, 1189, 1500, 1536, 1449,
            1642,  119, 1398, 1594,  408,  318,  169,  483,  114,   64,  603,
              12,   50,  178,  513, 1639, 1191,  134,  963],
           dtype='int64', name='movie_id')

11                             Usual Suspects, The (1995)
49                                       Star Wars (1977)
63                       Shawshank Redemption, The (1994)
113     Wallace & Gromit: The Best of Aardman Animatio...
118                Maya Lin: A Strong Clear Vision (1994)
133                                   Citizen Kane (1941)
168                            Wrong Trousers, The (1993)
177                                   12 Angry Men (1957)
317                               Schindler's List (1993)
407                                 Close Shave, A (1995)
482                                     Casablanca (1942)
512                                 Third Man, The (1949)
602                                    Rear Window (1954)
813                         Great Day in Harlem, A (1994)
962               Some Folks Call It a Sling Blade (1993)
1121                       They Made Me a Criminal (1939)
1188                                   Prefontaine (1997)
1190                      Letter From Death Row, A (1998)
1200           Marlene Dietrich: Shadow and Light (1996)
1292                                      Star Kid (1997)
1397                                          Anna (1996)
1448                               Pather Panchali (1955)
1466                 Saint of Fort Washington, The (1993)
1499                            Santa with Muscles (1996)
1535                                 Aiqing wansui (1994)
1593                                       Everest (1998)
1598                        Someone Else's America (1995)
1638                  Bitter Sugar (Azucar Amargo) (1996)
1641                             Some Mother's Son (1996)
1652    Entertaining Angels: The Dorothy Day Story (1996)
Name: title, dtype: object

In [122]:
# check male dominance for each occupation
gender_dominance = lambda f: (f == 'M').sum() > (f == 'F').sum()
user_groups_by_occupation = users['gender'].groupby(users.occupation)
male_dominant = user_groups_by_occupation.apply(gender_dominance)
print (male_dominant)

occupation
administrator     True
artist            True
doctor            True
educator          True
engineer          True
entertainment     True
executive         True
healthcare       False
homemaker        False
lawyer            True
librarian        False
marketing         True
none              True
other             True
programmer        True
retired           True
salesman          True
scientist         True
student           True
technician        True
writer            True
Name: gender, dtype: bool